### Terraform Apply ✅ Succeeded

<details><summary>Show apply output</summary>

```
module.devops.tls_private_key.ssh_key_customer: Refreshing state... [id=fa3faeff01a53fb23eba3ca1813c2b628bf0635c]
module.devops.tls_private_key.ssh_key: Refreshing state... [id=e258ae1e311871c57d4f60314821c86a618c855b]
module.devops.aws_ssm_parameter.private_key: Refreshing state... [id=/key_pairs/flyflow/private_key]
module.devops.aws_ssm_parameter.aws_secret_key: Refreshing state... [id=/devops/aws_secret_key]
module.devops.aws_ssm_parameter.github_token: Refreshing state... [id=/devops/github_token]
module.devops.aws_s3_bucket.flyflow_artifact_bucket: Refreshing state... [id=flyflow-artifacts-staging]
module.devops.aws_ssm_parameter.public_key_customer: Refreshing state... [id=/shared/flyflow_customers/public_key]
module.devops.aws_ssm_parameter.aws_access_key_id: Refreshing state... [id=/devops/aws_access_key_id]
module.devops.aws_route53_zone.my_domain: Refreshing state... [id=Z01823541YF2W4LAQSP9W]
module.devops.aws_key_pair.ec2_key_pair: Refreshing state... [id=aws_flyflow_generated]
module.devops.aws_dynamodb_table.tfstate_locking: Refreshing state... [id=tfstate-locking-new]
module.devops.aws_s3_bucket.grafana_backup: Refreshing state... [id=flyflow-grafana-backups-staging]
module.devops.aws_ssm_parameter.customer_account_id: Refreshing state... [id=/shared/application/ec2/aws-account-id]
module.devops.aws_s3_bucket.jenkins_backup: Refreshing state... [id=flyflow-jenkins-backup-staging]
module.devops.aws_key_pair.ec2_key_pair_customer: Refreshing state... [id=customers_aws_key]
module.devops.aws_security_group.allow_ssh_customers: Refreshing state... [id=sg-06f9e598ebaab5538]
module.devops.aws_ssm_parameter.public_key: Refreshing state... [id=/key_pairs/aws_flyflow/public_key]
module.devops.aws_ssm_parameter.customer_sg: Refreshing state... [id=/shared/application/ec2/server-sg]
module.devops.aws_ssm_parameter.route53_nameservers: Refreshing state... [id=/route53/nameservers]
module.devops.aws_route53_record.cname_record: Refreshing state... [id=Z01823541YF2W4LAQSP9W_www.flyflow.io_CNAME]
module.devops.aws_route53_record.jenkins_subdomain: Refreshing state... [id=Z01823541YF2W4LAQSP9W_jenkins.flyflow.io_A]
module.devops.aws_s3_bucket_versioning.grafana_versioning: Refreshing state... [id=flyflow-grafana-backups-staging]
module.devops.aws_iam_policy.grafana_s3_policy: Refreshing state... [id=arn:aws:iam::580186901909:policy/grafana-s3-backup-policy]
module.devops.aws_s3_bucket_versioning.versioning: Refreshing state... [id=flyflow-jenkins-backup-staging]
module.devops.aws_iam_policy.jenkins_s3_policy: Refreshing state... [id=arn:aws:iam::580186901909:policy/jenkins-s3-backup-policy]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.devops.aws_ssm_parameter.aws_access_key_id has changed
  ~ resource "aws_ssm_parameter" "aws_access_key_id" {
        id        = "/devops/aws_access_key_id"
        name      = "/devops/aws_access_key_id"
      ~ value     = (sensitive value)
        # (7 unchanged attributes hidden)
    }

  # module.devops.aws_ssm_parameter.aws_secret_key has changed
  ~ resource "aws_ssm_parameter" "aws_secret_key" {
        id        = "/devops/aws_secret_key"
        name      = "/devops/aws_secret_key"
      ~ value     = (sensitive value)
        # (7 unchanged attributes hidden)
    }

  # module.devops.aws_ssm_parameter.github_token has changed
  ~ resource "aws_ssm_parameter" "github_token" {
        id        = "/devops/github_token"
        name      = "/devops/github_token"
      ~ value     = (sensitive value)
        # (7 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.devops.github_actions_secret.shared_secrets["auth-service.ARTIFACT_BUCKET"] will be created
  + resource "github_actions_secret" "shared_secrets" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "auth-service"
      + secret_name     = "ARTIFACT_BUCKET"
      + updated_at      = (known after apply)
    }

  # module.devops.github_actions_secret.shared_secrets["auth-service.AWS_ACCESS_KEY_ID"] will be created
  + resource "github_actions_secret" "shared_secrets" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "auth-service"
      + secret_name     = "AWS_ACCESS_KEY_ID"
      + updated_at      = (known after apply)
    }

  # module.devops.github_actions_secret.shared_secrets["auth-service.AWS_REGION"] will be created
  + resource "github_actions_secret" "shared_secrets" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "auth-service"
      + secret_name     = "AWS_REGION"
      + updated_at      = (known after apply)
    }

  # module.devops.github_actions_secret.shared_secrets["auth-service.AWS_SECRET_ACCESS_KEY"] will be created
  + resource "github_actions_secret" "shared_secrets" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "auth-service"
      + secret_name     = "AWS_SECRET_ACCESS_KEY"
      + updated_at      = (known after apply)
    }

  # module.devops.github_actions_secret.shared_secrets["auth-service.GH_FLYFLOW_TOKEN"] will be created
  + resource "github_actions_secret" "shared_secrets" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "auth-service"
      + secret_name     = "GH_FLYFLOW_TOKEN"
      + updated_at      = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.
module.devops.github_actions_secret.shared_secrets["auth-service.AWS_REGION"]: Creating...
module.devops.github_actions_secret.shared_secrets["auth-service.GH_FLYFLOW_TOKEN"]: Creating...
module.devops.github_actions_secret.shared_secrets["auth-service.ARTIFACT_BUCKET"]: Creating...
module.devops.github_actions_secret.shared_secrets["auth-service.AWS_SECRET_ACCESS_KEY"]: Creating...
module.devops.github_actions_secret.shared_secrets["auth-service.AWS_ACCESS_KEY_ID"]: Creating...
module.devops.github_actions_secret.shared_secrets["auth-service.AWS_REGION"]: Creation complete after 6s [id=auth-service:AWS_REGION]
module.devops.github_actions_secret.shared_secrets["auth-service.GH_FLYFLOW_TOKEN"]: Creation complete after 6s [id=auth-service:GH_FLYFLOW_TOKEN]
module.devops.github_actions_secret.shared_secrets["auth-service.ARTIFACT_BUCKET"]: Creation complete after 6s [id=auth-service:ARTIFACT_BUCKET]
module.devops.github_actions_secret.shared_secrets["auth-service.AWS_SECRET_ACCESS_KEY"]: Creation complete after 6s [id=auth-service:AWS_SECRET_ACCESS_KEY]
module.devops.github_actions_secret.shared_secrets["auth-service.AWS_ACCESS_KEY_ID"]: Creation complete after 6s [id=auth-service:AWS_ACCESS_KEY_ID]

Apply complete! Resources: 5 added, 0 changed, 0 destroyed.

```
</details>